const items = [
  {
    title: "Як я можу викупити товари за ритейл ціною на сайті?",
    content: "Вам потрібно мати підписку, щоб мати змогу викупати позиції, які є на веб-сайті. Отримавши підписку, ви зможете брати участь у наших щотижневих дропах!"
  },
  {
    title: "Чи можна скасувати моє замовлення чи я можу отримати відшкодування?",
    content: "Ми пропонуємо повну гарантію повернення грошей для всіх покупок, зроблених на нашому веб-сайті, якщо допущені помилки щодо вашого замовлення з нашої сторони. В іншому випадку ми не можемо ні повернути кошти, ні скасувати бронювання."
  },
  {
    title: "Скільки позицій я можу придбати за один дроп?",
    content: "На даний момент ми приймаємо лише одну позицію на особу. Якщо ми помітимо, що для наших учасників достатньо запасів, ми дозволимо більше."
  },
  {
    title: "Скільки коштує підписка?",
    content: "Підписка коштує 8 грн. на місяць."
  },
  {
    title: "Скільки часу зазвичай займає доставка?",
    content: "Ми намагаємося відправляти всі замовлення протягом 6 робочих днів, кожне замовлення отримує трек-номер, щоб Ви завжди могли перевірити свій товар у будь-який час!"
  },
  {
    title: "Чи гарантовано я зможу придбати бажану річ?",
    content: "Ви зможете приймати участь у кожному дропі за період Вашої підписки на нашому сайті щотижня, але це не означає, що Ви гарантовано отримуватимете бажану річ."
  },
  {
    title: "Чи можу я скасувати свою підписку, коли захочу?",
    content: "Підписку можна скасувати в будь-який час. Повернення коштів за підписку неможливе."
  },
  {
    title: "Ви доставляєте за кордон?",
    content: "Так, ми здійснюємо міжнародні доставки. Ознайомтеся з тарифами на доставку в нашій актуальній історії в Instagram!"
  },
  {
    title: "Коли відбуваються щотижневі дропи?",
    content: "Час дропів оголошується в нашому Instagram щотижня."
  },
  {
    title: "Як я можу зв’язатися з Galiery?",
    content: "Ви можете зв’язатися з нами в Instagram: @galiery.drop. Ми також доступні через електронну пошту: galierydrop.help@gmail.com."
  },
  {
    title: "Galiery продає легальні речі?",
    content: "Так, ми продаємо лише 100% оригінальні товари. Перш ніж розмістити товар на нашому сайті, ми перевіряємо його стан і справжність."
  },
];

export default items;